Revit 2024 API
TextNode.IsItalic Property
 Indicates whether the default formatting is set to italic text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsItalic { get; }
Visual Basic
Public ReadOnly Property IsItalic As Boolean
	Get
Visual C++
public:
property bool IsItalic {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace